In [43]:
import numpy as np 
import pandas as pd

## Group by

In [44]:
df = pd.read_csv('Salaries.csv')

In [45]:
df.head()

   Unnamed: 0    Company Person  Sales
0           0     GOOGLE     P1   4500
1           1     GOOGLE     P2   5500
2           2  MICROSOFT     P3   1000
3           3  MICROSOFT     P4   3400
4           4   FACEBOOK     P5   1000

In [46]:
data = {'Comapny' : ['GOOGLE', 'GOOGLE','MICROSOFT', 'MICROSOFT', 'FACEBOOK', 'FACEBOOK'], 'Person': ['P1', 'P2','P3','P4','P5','P6'],'Sales': [4500,5500,1000,3400,1000,5000]}

In [47]:
df = pd.DataFrame(data)

In [48]:
df

     Comapny Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000
5   FACEBOOK     P6   5000

In [49]:
df.sum()

Comapny    GOOGLEGOOGLEMICROSOFTMICROSOFTFACEBOOKFACEBOOK
Person                                       P1P2P3P4P5P6
Sales                                               20400
dtype: object

In [50]:
df.groupby('Comapny').sum()

           Sales
Comapny
FACEBOOK    6000
GOOGLE     10000
MICROSOFT   4400

In [51]:
df.groupby('Comapny').min()

          Person  Sales
Comapny
FACEBOOK      P5   1000
GOOGLE        P1   4500
MICROSOFT     P3   1000

In [52]:
df.groupby('Comapny').mean()

           Sales
Comapny
FACEBOOK    3000
GOOGLE      5000
MICROSOFT   2200

In [53]:
df.describe()

             Sales
count     6.000000
mean   3400.000000
std    1984.943324
min    1000.000000
25%    1600.000000
50%    3950.000000
75%    4875.000000
max    5500.000000

In [54]:
df.groupby('Comapny').describe()

          Sales
          count    mean          std     min     25%     50%     75%     max
Comapny
FACEBOOK    2.0  3000.0  2828.427125  1000.0  2000.0  3000.0  4000.0  5000.0
GOOGLE      2.0  5000.0   707.106781  4500.0  4750.0  5000.0  5250.0  5500.0
MICROSOFT   2.0  2200.0  1697.056275  1000.0  1600.0  2200.0  2800.0  3400.0

In [55]:
df1 = pd.concat([df, pd.DataFrame({'Comapny': 'AMAZON', 'Person': 'P7', 'Sales': 6000}, index=[6])])
df1

     Comapny Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000
5   FACEBOOK     P6   5000
6     AMAZON     P7   6000

In [56]:
df = pd.concat([df, pd.DataFrame([1,2,3,4,5,6], columns= ['Number'])], axis = 1)

In [57]:
df

     Comapny Person  Sales  Number
0     GOOGLE     P1   4500       1
1     GOOGLE     P2   5500       2
2  MICROSOFT     P3   1000       3
3  MICROSOFT     P4   3400       4
4   FACEBOOK     P5   1000       5
5   FACEBOOK     P6   5000       6

## Miscellaneous

In [58]:
df['Comapny'].unique()

array(['GOOGLE', 'MICROSOFT', 'FACEBOOK'], dtype=object)

In [59]:
df['Comapny'].nunique()

3

In [60]:
df.groupby('Comapny').count()

           Person  Sales  Number
Comapny
FACEBOOK        2      2       2
GOOGLE          2      2       2
MICROSOFT       2      2       2

In [61]:
df['Comapny'].value_counts()

MICROSOFT    2
GOOGLE       2
FACEBOOK     2
Name: Comapny, dtype: int64

In [62]:
def times(value):
    return value*2

In [63]:
df1 = df['Number'].apply(times)
df1

0     2
1     4
2     6
3     8
4    10
5    12
Name: Number, dtype: int64

In [64]:
df['Number'].apply(lambda x: x*2)

0     2
1     4
2     6
3     8
4    10
5    12
Name: Number, dtype: int64

In [65]:
df['Comapny'].apply(len)

0    6
1    6
2    9
3    9
4    8
5    8
Name: Comapny, dtype: int64

In [66]:
df.apply(len)

Comapny    6
Person     6
Sales      6
Number     6
dtype: int64

In [67]:
df.sort_values('Sales', ascending = False)

     Comapny Person  Sales  Number
1     GOOGLE     P2   5500       2
5   FACEBOOK     P6   5000       6
0     GOOGLE     P1   4500       1
3  MICROSOFT     P4   3400       4
2  MICROSOFT     P3   1000       3
4   FACEBOOK     P5   1000       5

In [68]:
df.drop('Number', axis =1, inplace = True)

In [69]:
df

     Comapny Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000
5   FACEBOOK     P6   5000

In [70]:
df.drop(5)

     Comapny Person  Sales
0     GOOGLE     P1   4500
1     GOOGLE     P2   5500
2  MICROSOFT     P3   1000
3  MICROSOFT     P4   3400
4   FACEBOOK     P5   1000

In [71]:
df.columns

Index(['Comapny', 'Person', 'Sales'], dtype='object')

In [72]:
df.index

RangeIndex(start=0, stop=6, step=1)